[
  {
    "Name": "Chicken Biryani",
    "Description": "A flavorful rice dish made with basmati rice, chicken, and aromatic spices.",
    "Ingredients": [
      "2 cups basmati rice",
      "500g chicken, cut into pieces",
      "2 onions, thinly sliced",
      "2 tomatoes, chopped",
      "4 cloves garlic, minced",
      "1-inch ginger, grated",
      "2 green chilies, slit",
      "1/2 cup plain yogurt",
      "1 teaspoon turmeric powder",
      "1 teaspoon red chili powder",
      "1 teaspoon garam masala",
      "1 teaspoon biryani masala",
      "1/4 cup chopped mint leaves",
      "1/4 cup chopped coriander leaves",
      "4 cups water",
      "4 tablespoons ghee",
      "Salt to taste"
    ],
    "Cuisine": "Indian",
    "MealType": "Main Course",
    "Author": "Chef789",
    "Method": "1. Wash the basmati rice and soak it in water for 30 minutes.\n2. Heat ghee in a large pan and sauté the onions until golden brown.\n3. Add garlic, ginger, and green chilies. Cook for a minute.\n4. Add chicken pieces and cook until they are browned.\n5. Stir in tomatoes, turmeric powder, red chili powder, garam masala, and biryani masala.\n6. Add yogurt, mint leaves, and coriander leaves. Mix well.\n7. Drain the soaked rice and add it to the pan. Stir gently.\n8. Add water and season with salt. Bring it to a boil.\n9. Reduce the heat, cover the pan, and let it simmer for 15-20 minutes or until the rice is cooked and the flavors are absorbed.\n10. Remove from heat and let it rest for 5 minutes.\n11. Fluff the rice with a fork and serve hot."
  },
  {
    "Name": "Paneer Tikka",
    "Description": "A popular vegetarian appetizer made with marinated paneer and grilled to perfection.",
    "Ingredients": [
      "250g paneer (cottage cheese), cut into cubes",
      "1 bell pepper, cut into pieces",
      "1 onion, cut into pieces",
      "1/2 cup yogurt",
      "2 tablespoons besan (gram flour)",
      "2 tablespoons lemon juice",
      "1 tablespoon ginger-garlic paste",
      "1 teaspoon turmeric powder",
      "1 teaspoon red chili powder",
      "1 teaspoon garam masala",
      "1 teaspoon chaat masala",
      "1 tablespoon oil",
      "Salt to taste"
    ],
    "Cuisine": "Indian",
    "MealType": "Appetizer",
    "Author": "Chef012",
    "Method": "1. In a bowl, combine yogurt, besan, lemon juice, ginger-garlic paste, turmeric powder, red chili powder, garam masala, chaat masala, oil, and salt.\n2. Add paneer cubes, bell pepper, and onion to the marinade. Mix well to coat the paneer and vegetables.\n3. Cover the bowl and marinate for at least 1 hour in the refrigerator.\n4. Preheat the grill or oven to medium-high heat.\n5. Thread the marinated paneer, bell pepper, and onion onto skewers.\n6. Grill the skewers for 8-10 minutes, turning occasionally, until the paneer is golden and the vegetables are slightly charred.\n7. Remove from the heat and serve hot with mint chutney."
  },
  {
    "Name": "Masala Dosa",
    "Description": "A popular South Indian dish made with fermented rice and lentil batter, filled with a spicy potato masala.",
    "Ingredients": [
      "2 cups dosa batter",
      "2 large potatoes, boiled and mashed",
      "1 onion, finely chopped",
      "2 green chilies, chopped",
      "1/2 teaspoon mustard seeds",
      "1/2 teaspoon cumin seeds",
      "1/2 teaspoon turmeric powder",
      "A pinch of asafoetida",
      "A few curry leaves",
      "2 tablespoons oil",
      "Salt to taste"
    ],
    "Cuisine": "Indian",
    "MealType": "Breakfast",
    "Author": "Chef345",
    "Method": "1. Heat oil in a pan and add mustard seeds. Let them splutter.\n2. Add cumin seeds, asafoetida, and curry leaves. Stir for a few seconds.\n3. Add chopped onions and green chilies. Sauté until onions turn translucent.\n4. Add turmeric powder and mashed potatoes. Mix well.\n5. Season with salt and cook for 2-3 minutes. Remove from heat.\n6. Heat a non-stick pan or griddle over medium heat.\n7. Pour a ladleful of dosa batter onto the pan and spread it in a circular motion to form a thin pancake.\n8. Drizzle a little oil around the edges and cook until the dosa turns golden brown.\n9. Place a spoonful of potato masala in the center of the dosa and fold it over.\n10. Serve hot with coconut chutney and sambar."
  },
  
    {
      "Name": "Margherita Pizza",
      "Description": "A classic Italian pizza topped with tomato sauce, mozzarella cheese, and fresh basil leaves.",
      "Ingredients": [
        "Pizza dough",
        "1 cup tomato sauce",
        "2 cups shredded mozzarella cheese",
        "Fresh basil leaves",
        "Olive oil",
        "Salt and pepper to taste"
      ],
      "Cuisine": "Italian",
      "MealType": "Main Course",
      "Author": "Chef123",
      "Method": "1. Preheat the oven to the highest temperature.\n2. Roll out the pizza dough into a thin circle.\n3. Place the rolled-out dough on a baking sheet.\n4. Spread tomato sauce evenly over the dough.\n5. Sprinkle shredded mozzarella cheese over the sauce.\n6. Season with salt and pepper.\n7. Drizzle a little olive oil over the pizza.\n8. Bake in the preheated oven for 10-12 minutes or until the crust is golden and the cheese is melted and bubbly.\n9. Remove from the oven and garnish with fresh basil leaves.\n10. Slice and serve hot."
    },
    {
      "Name": "Spaghetti Carbonara",
      "Description": "A classic Roman pasta dish made with spaghetti, eggs, pancetta, Parmesan cheese, and black pepper.",
      "Ingredients": [
        "200g spaghetti",
        "100g pancetta or bacon, diced",
        "2 large eggs",
        "1/2 cup grated Parmesan cheese",
        "Freshly ground black pepper",
        "Salt to taste"
      ],
      "Cuisine": "Italian",
      "MealType": "Main Course",
      "Author": "Chef234",
      "Method": "1. Cook the spaghetti in a large pot of salted boiling water until al dente.\n2. In a separate pan, cook the pancetta or bacon until crispy.\n3. In a bowl, whisk together the eggs, grated Parmesan cheese, and a generous amount of freshly ground black pepper.\n4. Drain the cooked spaghetti and add it to the pan with the cooked pancetta or bacon.\n5. Immediately pour the egg and cheese mixture over the hot spaghetti.\n6. Toss quickly to coat the spaghetti evenly and cook for a minute.\n7. The heat from the spaghetti will cook the eggs, creating a creamy sauce.\n8. Season with salt if needed.\n9. Serve hot with an extra sprinkle of grated Parmesan cheese and black pepper."
    },
    {
      "Name": "Caprese Salad",
      "Description": "A refreshing Italian salad made with ripe tomatoes, fresh mozzarella cheese, basil leaves, and balsamic glaze.",
      "Ingredients": [
        "2 ripe tomatoes, sliced",
        "8 ounces fresh mozzarella cheese, sliced",
        "Fresh basil leaves",
        "2 tablespoons balsamic glaze",
        "Extra virgin olive oil",
        "Salt and pepper to taste"
      ],
      "Cuisine": "Italian",
      "MealType": "Appetizer",
      "Author": "Chef456",
      "Method": "1. Arrange the tomato and mozzarella slices on a platter.\n2. Place a fresh basil leaf on top of each tomato and mozzarella slice.\n3. Drizzle the balsamic glaze and extra virgin olive oil over the salad.\n4. Season with salt and pepper.\n5. Serve immediately as an appetizer or a light side dish."
    },
    {
      "Name": "Lasagna",
      "Description": "A classic Italian pasta dish made with layers of lasagna noodles, meat sauce, and cheese.",
      "Ingredients": [
        "12 lasagna noodles",
        "1 pound ground beef",
        "1 onion, chopped",
        "2 cloves garlic, minced",
        "2 cups marinara sauce",
        "2 cups ricotta cheese",
        "2 cups shredded mozzarella cheese",
        "1/2 cup grated Parmesan cheese",
        "Fresh basil leaves",
        "Salt and pepper to taste"
      ],
      "Cuisine": "Italian",
      "MealType": "Main Course",
      "Author": "Chef567",
      "Method": "1. Cook the lasagna noodles according to the package instructions.\n2. In a large skillet, cook the ground beef, onion, and garlic until the beef is browned and the onion is tender.\n3. Drain any excess grease from the skillet.\n4. Add the marinara sauce to the skillet and simmer for 10 minutes.\n5. In a separate bowl, mix together the ricotta cheese, shredded mozzarella cheese, grated Parmesan cheese, chopped fresh basil leaves, salt, and pepper.\n6. Preheat the oven to 375°F (190°C).\n7. Spread a thin layer of the meat sauce in the bottom of a baking dish.\n8. Place a layer of cooked lasagna noodles on top of the sauce.\n9. Spread a layer of the cheese mixture over the noodles.\n10. Repeat the layers until all the ingredients are used, ending with a layer of cheese.\n11. Cover the baking dish with foil and bake for 30 minutes.\n12. Remove the foil and bake for an additional 10 minutes or until the cheese is melted and bubbly.\n13. Let it rest for a few minutes before serving."
    },
    {
      "Name": "Tiramisu",
      "Description": "A classic Italian dessert made with layers of coffee-soaked ladyfingers and a creamy mixture of mascarpone cheese, eggs, sugar, and cocoa.",
      "Ingredients": [
        "24 ladyfingers",
        "1 cup strong brewed coffee, cooled",
        "1/4 cup coffee liqueur (optional)",
        "8 ounces mascarpone cheese",
        "2/3 cup granulated sugar",
        "2 large eggs",
        "Cocoa powder for dusting"
      ],
      "Cuisine": "Italian",
      "MealType": "Dessert",
      "Author": "Chef678",
      "Method": "1. In a shallow dish, combine the cooled coffee and coffee liqueur (if using).\n2. In a mixing bowl, beat the mascarpone cheese, granulated sugar, and eggs until creamy and well combined.\n3. Dip each ladyfinger into the coffee mixture, soaking it for a few seconds on each side.\n4. Arrange a layer of soaked ladyfingers in the bottom of a serving dish.\n5. Spread a layer of the mascarpone mixture over the ladyfingers.\n6. Repeat the layers, ending with a layer of the mascarpone mixture.\n7. Dust the top layer with cocoa powder.\n8. Cover and refrigerate for at least 4 hours or overnight.\n9. Slice and serve chilled."
    },
    {
      "Name": "Chicken Parmesan",
      "Description": "A delicious Italian-American dish made with breaded chicken cutlets topped with marinara sauce and melted mozzarella cheese.",
      "Ingredients": [
        "4 boneless, skinless chicken breasts",
        "1 cup breadcrumbs",
        "1/2 cup grated Parmesan cheese",
        "1 teaspoon dried oregano",
        "1 teaspoon dried basil",
        "1/2 teaspoon garlic powder",
        "Salt and pepper to taste",
        "1 cup marinara sauce",
        "1 cup shredded mozzarella cheese",
        "Fresh basil leaves for garnish"
      ],
      "Cuisine": "Italian",
      "MealType": "Main Course",
      "Author": "Chef789",
      "Method": "1. Preheat the oven to 375°F (190°C).\n2. In a shallow dish, combine the breadcrumbs, grated Parmesan cheese, dried oregano, dried basil, garlic powder, salt, and pepper.\n3. Dredge each chicken breast in the breadcrumb mixture, pressing to adhere.\n4. Heat a large skillet over medium heat and add olive oil.\n5. Cook the breaded chicken breasts in the skillet for about 4-5 minutes on each side, or until golden brown.\n6. Remove the chicken breasts from the skillet and place them in a baking dish.\n7. Top each chicken breast with marinara sauce and shredded mozzarella cheese.\n8. Bake in the preheated oven for 15-20 minutes, or until the chicken is cooked through and the cheese is melted and bubbly.\n9. Garnish with fresh basil leaves before serving."
    },
    {
      "Name": "Bruschetta",
      "Description": "A classic Italian appetizer made with grilled bread slices topped with fresh tomatoes, garlic, basil, and olive oil.",
      "Ingredients": [
        "1 baguette, sliced",
        "4 tomatoes, diced",
        "2 cloves garlic, minced",
        "Fresh basil leaves, chopped",
        "Extra virgin olive oil",
        "Balsamic vinegar (optional)",
        "Salt and pepper to taste"
      ],
      "Cuisine": "Italian",
      "MealType": "Appetizer",
      "Author": "Chef890",
      "Method": "1. Preheat a grill or grill pan.\n2. Brush the bread slices with olive oil.\n3. Grill the bread slices until toasted and grill marks appear.\n4. In a bowl, combine the diced tomatoes, minced garlic, chopped fresh basil leaves, salt, and pepper.\n5. Drizzle with olive oil and balsamic vinegar if desired.\n6. Spoon the tomato mixture onto the grilled bread slices.\n7. Serve immediately as an appetizer or a light snack."
    },
      {
        "Name": "Hummus",
        "Description": "A popular Middle Eastern dip made with cooked chickpeas, tahini, lemon juice, garlic, and olive oil.",
        "Ingredients": [
          "2 cups cooked chickpeas",
          "1/2 cup tahini",
          "2 cloves garlic, minced",
          "3 tablespoons lemon juice",
          "3 tablespoons olive oil",
          "Salt to taste",
          "Paprika and olive oil for garnish"
        ],
        "Cuisine": "Arabian",
        "MealType": "Appetizer",
        "Author": "Chef123",
        "Method": "1. In a food processor, combine the cooked chickpeas, tahini, minced garlic, lemon juice, olive oil, and salt.\n2. Process until smooth and creamy, adding a little water if needed to reach the desired consistency.\n3. Transfer the hummus to a serving bowl.\n4. Drizzle with olive oil and sprinkle with paprika.\n5. Serve with pita bread or fresh vegetables."
      },
      {
        "Name": "Mansaf",
        "Description": "A traditional Jordanian dish made with lamb cooked in a flavorful yogurt sauce and served with rice and flatbread.",
        "Ingredients": [
          "2 pounds lamb, cut into pieces",
          "2 cups plain yogurt",
          "3 cups water",
          "1 onion, chopped",
          "3 cloves garlic, minced",
          "1/4 cup ghee or clarified butter",
          "1 teaspoon ground cumin",
          "1 teaspoon ground coriander",
          "Salt and pepper to taste",
          "Cooked rice and flatbread for serving",
          "Chopped parsley for garnish"
        ],
        "Cuisine": "Arabian",
        "MealType": "Main Course",
        "Author": "Chef234",
        "Method": "1. In a large pot, heat the ghee or clarified butter over medium heat.\n2. Add the chopped onion and minced garlic, and sauté until golden brown.\n3. Add the lamb pieces to the pot and cook until browned on all sides.\n4. In a separate bowl, whisk together the yogurt, water, ground cumin, ground coriander, salt, and pepper.\n5. Pour the yogurt mixture over the lamb in the pot.\n6. Bring to a simmer, then reduce the heat to low and cover the pot.\n7. Cook for about 2 hours, or until the lamb is tender and the sauce has thickened.\n8. Serve the mansaf over cooked rice, with flatbread on the side.\n9. Garnish with chopped parsley."
      },
      {
        "Name": "Tabbouleh",
        "Description": "A refreshing salad made with bulgur wheat, tomatoes, cucumbers, parsley, mint, lemon juice, and olive oil.",
        "Ingredients": [
          "1 cup bulgur wheat",
          "2 cups boiling water",
          "2 cups finely chopped parsley",
          "1 cup finely chopped fresh mint",
          "4 tomatoes, diced",
          "2 cucumbers, diced",
          "1/4 cup lemon juice",
          "1/4 cup olive oil",
          "Salt and pepper to taste"
        ],
        "Cuisine": "Arabian",
        "MealType": "Salad",
        "Author": "Chef345",
        "Method": "1. Place the bulgur wheat in a bowl and pour the boiling water over it.\n2. Cover and let it sit for about 30 minutes, or until the bulgur is tender and has absorbed the water.\n3. Fluff the bulgur with a fork and let it cool.\n4. In a large bowl, combine the chopped parsley, chopped mint, diced tomatoes, and diced cucumbers.\n5. Add the cooled bulgur to the bowl and toss to combine.\n6. In a small bowl, whisk together the lemon juice, olive oil, salt, and pepper.\n7. Pour the dressing over the salad and toss to coat evenly.\n8. Refrigerate for at least 1 hour before serving to allow the flavors to meld."
      },
      {
        "Name": "Shawarma",
        "Description": "A popular Middle Eastern street food made with marinated grilled meat (usually chicken or lamb) wrapped in flatbread and topped with tahini sauce and vegetables.",
        "Ingredients": [
          "1 pound boneless chicken or lamb, thinly sliced",
          "1/4 cup olive oil",
          "2 tablespoons lemon juice",
          "2 cloves garlic, minced",
          "1 teaspoon ground cumin",
          "1 teaspoon ground coriander",
          "1/2 teaspoon ground paprika",
          "Salt and pepper to taste",
          "Flatbread or pita bread",
          "Tahini sauce",
          "Sliced tomatoes, cucumbers, and onions for topping"
        ],
        "Cuisine": "Arabian",
        "MealType": "Main Course",
        "Author": "Chef456",
        "Method": "1. In a bowl, combine the olive oil, lemon juice, minced garlic, ground cumin, ground coriander, ground paprika, salt, and pepper.\n2. Add the thinly sliced chicken or lamb to the bowl and toss to coat the meat in the marinade.\n3. Cover and refrigerate for at least 1 hour, or overnight for best results.\n4. Preheat a grill or grill pan over medium-high heat.\n5. Grill the marinated meat for about 4-5 minutes per side, or until cooked through and slightly charred.\n6. Remove the grilled meat from the heat and let it rest for a few minutes.\n7. Warm the flatbread or pita bread.\n8. Spread a layer of tahini sauce on the bread.\n9. Place a portion of the grilled meat on top of the sauce.\n10. Add sliced tomatoes, cucumbers, and onions.\n11. Roll up the bread to form a shawarma wrap.\n12. Serve immediately."
      },
      {
        "Name": "Baklava",
        "Description": "A sweet pastry made with layers of phyllo dough, nuts (usually pistachios or walnuts), honey, and spices.",
        "Ingredients": [
          "1 pound phyllo dough",
          "1 cup unsalted butter, melted",
          "2 cups finely chopped nuts (pistachios or walnuts)",
          "1 cup granulated sugar",
          "1 teaspoon ground cinnamon",
          "1/2 teaspoon ground cloves",
          "1 cup water",
          "1 cup honey",
          "1 teaspoon lemon juice"
        ],
        "Cuisine": "Arabian",
        "MealType": "Dessert",
        "Author": "Chef567",
        "Method": "1. Preheat the oven to 350°F (175°C).\n2. In a bowl, combine the finely chopped nuts, granulated sugar, ground cinnamon, and ground cloves.\n3. Brush a baking dish with melted butter.\n4. Place a sheet of phyllo dough in the dish and brush it with melted butter.\n5. Repeat the process, layering the phyllo sheets and brushing each layer with butter, until half of the phyllo sheets are used.\n6. Sprinkle half of the nut mixture evenly over the phyllo layers.\n7. Layer the remaining phyllo sheets on top, brushing each layer with butter.\n8. Sprinkle the remaining nut mixture over the phyllo layers.\n9. Using a sharp knife, cut the baklava into diamond-shaped pieces.\n10. Bake in the preheated oven for about 45-50 minutes, or until golden brown and crisp.\n11. While the baklava is baking, combine the water, honey, and lemon juice in a saucepan.\n12. Bring the mixture to a boil, then reduce the heat and let it simmer for 10 minutes.\n13. Remove the baklava from the oven and immediately pour the honey syrup over it.\n14. Allow the baklava to cool completely before serving."
      },
      
        {
          "Name": "Bibimbap",
          "Description": "A popular Korean mixed rice dish topped with various vegetables, meat, and a fried egg.",
          "Ingredients": [
            "2 cups cooked rice",
            "1 cup assorted vegetables (carrots, spinach, bean sprouts, mushrooms, etc.), blanched or sautéed",
            "1/2 cup cooked protein (beef, chicken, tofu, etc.)",
            "1 fried egg",
            "2 tablespoons gochujang (Korean red pepper paste)",
            "1 tablespoon sesame oil",
            "1 tablespoon soy sauce",
            "1 teaspoon sugar",
            "Sesame seeds for garnish",
            "Sliced green onions for garnish"
          ],
          "Cuisine": "Korean",
          "MealType": "Main Course",
          "Author": "Chef123",
          "Method": "1. In a small bowl, mix together gochujang, sesame oil, soy sauce, and sugar to make the sauce.\n2. In a large bowl, place the cooked rice as the base.\n3. Arrange the blanched or sautéed vegetables and cooked protein on top of the rice.\n4. Drizzle the sauce over the ingredients.\n5. Top with a fried egg.\n6. Sprinkle sesame seeds and sliced green onions as garnish.\n7. Mix everything together before eating."
        },
        {
          "Name": "Kimchi Jjigae",
          "Description": "A spicy Korean stew made with kimchi, tofu, pork, and various seasonings.",
          "Ingredients": [
            "1 cup well-fermented kimchi, chopped",
            "1/2 cup pork belly or shoulder, sliced",
            "1/2 cup tofu, diced",
            "1 onion, sliced",
            "2 cloves garlic, minced",
            "1 tablespoon gochujang (Korean red pepper paste)",
            "1 tablespoon gochugaru (Korean red pepper flakes)",
            "1 tablespoon soy sauce",
            "1 tablespoon sesame oil",
            "2 cups water or broth",
            "Sliced green onions for garnish"
          ],
          "Cuisine": "Korean",
          "MealType": "Main Course",
          "Author": "Chef234",
          "Method": "1. Heat sesame oil in a pot over medium heat.\n2. Add the sliced pork and minced garlic, and cook until the pork is browned.\n3. Add the chopped kimchi, sliced onion, gochujang, gochugaru, and soy sauce. Stir well.\n4. Add water or broth and bring to a boil.\n5. Reduce heat to low and simmer for about 15-20 minutes.\n6. Add diced tofu and continue simmering for another 5 minutes.\n7. Serve hot with a sprinkle of sliced green onions."
        },
        {
          "Name": "Japchae",
          "Description": "A Korean stir-fried noodle dish made with sweet potato noodles, vegetables, and beef.",
          "Ingredients": [
            "4 ounces sweet potato noodles",
            "4 ounces beef, thinly sliced",
            "1/2 cup sliced vegetables (carrots, bell peppers, onions, mushrooms, etc.)",
            "2 cloves garlic, minced",
            "2 tablespoons soy sauce",
            "1 tablespoon sesame oil",
            "1 tablespoon sugar",
            "1 tablespoon vegetable oil",
            "Sesame seeds for garnish"
          ],
          "Cuisine": "Korean",
          "MealType": "Main Course",
          "Author": "Chef345",
          "Method": "1. Cook the sweet potato noodles according to package instructions. Drain and set aside.\n2. In a bowl, marinate the beef with soy sauce, sesame oil, and sugar.\n3. Heat vegetable oil in a large pan or wok over medium-high heat.\n4. Add minced garlic and sliced vegetables. Stir-fry until the vegetables are tender.\n5. Push the vegetables to one side of the pan and add the marinated beef. Cook until the beef is browned.\n6. Add the cooked sweet potato noodles to the pan and toss everything together.\n7. Cook for another 2-3 minutes to heat through.\n8. Sprinkle with sesame seeds as garnish.\n9. Serve hot."
        },
        {
          "Name": "Korean Fried Chicken",
          "Description": "Crispy and juicy fried chicken coated with a sweet and spicy sauce.",
          "Ingredients": [
            "1 pound chicken wings or drumsticks",
            "1/2 cup all-purpose flour",
            "1/2 cup cornstarch",
            "1 teaspoon salt",
            "1/2 teaspoon black pepper",
            "Vegetable oil for frying",
            "For the sauce:",
            "3 tablespoons gochujang (Korean red pepper paste)",
            "2 tablespoons ketchup",
            "2 tablespoons honey",
            "1 tablespoon soy sauce",
            "1 tablespoon rice vinegar",
            "1 tablespoon sesame oil",
            "2 cloves garlic, minced",
            "1 teaspoon grated ginger",
            "Sesame seeds and sliced green onions for garnish"
          ],
          "Cuisine": "Korean",
          "MealType": "Appetizer",
          "Author": "Chef456",
          "Method": "1. In a bowl, combine all-purpose flour, cornstarch, salt, and black pepper.\n2. Dredge the chicken wings or drumsticks in the flour mixture, shaking off any excess.\n3. Heat vegetable oil in a deep fryer or large pot to 350°F (175°C).\n4. Fry the chicken in batches until golden brown and cooked through, about 10-12 minutes.\n5. Remove the fried chicken from the oil and drain on a paper towel-lined plate.\n6. In a saucepan, combine gochujang, ketchup, honey, soy sauce, rice vinegar, sesame oil, minced garlic, and grated ginger.\n7. Heat the sauce over low heat, stirring until well combined and heated through.\n8. Toss the fried chicken in the sauce until evenly coated.\n9. Garnish with sesame seeds and sliced green onions.\n10. Serve hot as an appetizer or main dish."
        },
          {
            "Name": "Dosa",
            "Description": "Crispy rice and lentil crepes stuffed with spiced potato filling.",
            "Ingredients": [
              "1 cup rice",
              "1/2 cup urad dal",
              "1/4 cup poha (flattened rice)",
              "Salt to taste",
              "Oil for cooking dosa",
              "For Potato Filling:",
              "2 large potatoes, boiled and mashed",
              "1 onion, finely chopped",
              "2 green chilies, finely chopped",
              "1/2 teaspoon mustard seeds",
              "1/2 teaspoon cumin seeds",
              "A pinch of asafoetida (hing)",
              "Curry leaves",
              "Salt to taste",
              "Oil for tempering"
            ],
            "Cuisine": "Indian",
            "MealType": "Breakfast",
            "Author": "John Doe"
          },
          {
            "Name": "Idly",
            "Description": "Steamed rice and lentil cakes served with chutney and sambar.",
            "Ingredients": [
              "1 cup idly rice",
              "1/4 cup urad dal",
              "Salt to taste",
              "Water as required",
              "Oil for greasing idly plates"
            ],
            "Cuisine": "Indian",
            "MealType": "Breakfast",
            "Author": "Jane Smith"
          },
          {
            "Name": "Upma",
            "Description": "A savory dish made with semolina, vegetables, and spices.",
            "Ingredients": [
              "1 cup semolina (rava)",
              "1 onion, finely chopped",
              "1 tomato, finely chopped",
              "1 carrot, finely chopped",
              "1 green chili, slit",
              "1/2 inch ginger, grated",
              "1/2 teaspoon mustard seeds",
              "1/2 teaspoon cumin seeds",
              "A pinch of asafoetida (hing)",
              "Curry leaves",
              "2 cups water",
              "2 tablespoons oil",
              "Salt to taste"
            ],
            "Cuisine": "Indian",
            "MealType": "Breakfast",
            "Author": "Michael Johnson"
          },
          {
            "Name": "Pongal",
            "Description": "A traditional South Indian dish made with rice and lentils, seasoned with spices and ghee.",
            "Ingredients": [
              "1 cup rice",
              "1/4 cup split yellow moong dal",
              "1/4 teaspoon turmeric powder",
              "1/2 teaspoon black pepper",
              "1/2 teaspoon cumin seeds",
              "A pinch of asafoetida (hing)",
              "Curry leaves",
              "2 tablespoons ghee",
              "Cashew nuts for garnishing",
              "Salt to taste",
              "Water as required"
            ],
            "Cuisine": "Indian",
            "MealType": "Breakfast",
            "Author": "Emily Davis"
          },
          {
            "Name": "Poori",
            "Description": "Deep-fried Indian bread made with whole wheat flour.",
            "Ingredients": [
              "2 cups whole wheat flour",
              "Water as required",
              "Salt to taste",
              "Oil for deep frying"
            ],
            "Cuisine": "Indian",
            "MealType": "Breakfast",
            "Author": "Robert Wilson"
          },
            {
              "Name": "Mandi",
              "Description": "Mandi is a traditional Arabic rice dish that is typically made with tender meat (such as lamb or chicken) and fragrant rice. It is a flavorful and aromatic dish, often seasoned with a blend of spices including cardamom, cinnamon, and cloves. Mandi is cooked in a special oven called a tandoor, which gives it a unique smoky flavor.",
              "Cuisine": "Arabic",
              "MealType": "Main",
              "Ingredients": [
                "2 cups basmati rice",
                "500g lamb or chicken, cut into pieces",
                "2 onions, thinly sliced",
                "4 cloves garlic, minced",
                "2 teaspoons ground cumin",
                "2 teaspoons ground coriander",
                "1 teaspoon ground cardamom",
                "1 teaspoon ground cinnamon",
                "1 teaspoon ground cloves",
                "1/2 teaspoon turmeric powder",
                "Salt to taste",
                "3 tablespoons ghee or vegetable oil",
                "4 cups chicken or vegetable broth",
                "1/4 cup almonds, sliced and toasted (for garnish)",
                "Fresh coriander leaves (for garnish)"
              ],
              "Method": "1. Wash the basmati rice in cold water and soak for 30 minutes.\n2. In a large pot, heat the ghee or vegetable oil over medium heat. Add the sliced onions and cook until golden brown.\n3. Add the minced garlic and spices (cumin, coriander, cardamom, cinnamon, cloves, turmeric) to the pot. Stir well to combine and cook for another minute.\n4. Add the meat pieces to the pot and cook until browned on all sides.\n5. Drain the soaked rice and add it to the pot, stirring gently to combine with the spices and meat.\n6. Pour in the chicken or vegetable broth and season with salt. Bring the mixture to a boil, then reduce the heat to low, cover the pot, and simmer for about 20-25 minutes or until the rice is cooked and the meat is tender.\n7. Remove the pot from the heat and let it sit, covered, for 5 minutes.\n8. Fluff the rice with a fork and transfer the Mandi to a serving dish. Garnish with toasted almonds and fresh coriander leaves.\n9. Serve hot and enjoy!"
            },
            {
              "Name": "Butter Chicken",
              "Description": "Butter Chicken, also known as Murgh Makhani, is a popular Indian dish known for its creamy and rich tomato-based gravy. The chicken is marinated in a spiced yogurt mixture, cooked in a tandoor or oven, and then simmered in a buttery tomato sauce. It is often served with naan or rice.",
              "Cuisine": "Indian",
              "MealType": "Main",
              "Ingredients": [
                "500g boneless chicken, cut into cubes",
                "1 cup plain yogurt",
                "2 tablespoons lemon juice",
                "2 teaspoons ginger-garlic paste",
                "2 teaspoons Kashmiri red chili powder",
                "1 teaspoon turmeric powder",
                "1 teaspoon garam masala",
                "Salt to taste",
                "3 tablespoons butter",
                "1 large onion, finely chopped",
                "2 tomatoes, pureed",
                "1/2 cup heavy cream",
                "1 teaspoon dried fenugreek leaves (kasuri methi)",
                "Fresh coriander leaves (for garnish)"
              ],
              "Method": "1. In a bowl, combine the plain yogurt, lemon juice, ginger-garlic paste, Kashmiri red chili powder, turmeric powder, garam masala, and salt. Mix well.\n2. Add the chicken cubes to the marinade and coat them evenly. Let the chicken marinate for at least 1 hour or overnight in the refrigerator.\n3. Preheat the oven to 200°C (400°F). Thread the marinated chicken onto skewers and place them on a baking sheet. Bake for about 15-20 minutes or until the chicken is cooked through.\n4. In a large pan, melt the butter over medium heat. Add the finely chopped onion and cook until it turns golden brown.\n5. Add the pureed tomatoes to the pan and cook for a few minutes until the mixture thickens.\n6. Reduce the heat to low and stir in the heavy cream and dried fenugreek leaves. Simmer for 5-7 minutes, stirring occasionally.\n7. Add the baked chicken to the pan and cook for another 5 minutes, allowing the flavors to blend together.\n8. Garnish with fresh coriander leaves and serve hot with naan or rice.\n9. Enjoy the delicious Butter Chicken!"
            },
            {
              "Name": "Chicken Burger",
              "Description": "Chicken Burger is a popular fast food item made with a juicy chicken patty served in a bun along with various toppings and sauces. It is a flavorful and satisfying meal that can be customized to individual preferences. Chicken burgers are often accompanied by lettuce, tomatoes, onions, cheese, and condiments such as ketchup, mayonnaise, or barbecue sauce.",
              "Cuisine": "American",
              "MealType": "Main",
              "Ingredients": [
                "500g ground chicken",
                "1/4 cup bread crumbs",
                "1/4 cup onion, finely chopped",
                "2 cloves garlic, minced",
                "1 teaspoon dried oregano",
                "1 teaspoon paprika",
                "1/2 teaspoon salt",
                "1/4 teaspoon black pepper",
                "4 burger buns",
                "Lettuce leaves",
                "Tomato slices",
                "Onion slices",
                "Cheese slices",
                "Ketchup",
                "Mayonnaise"
              ],
              "Method": "1. In a large bowl, combine the ground chicken, bread crumbs, finely chopped onion, minced garlic, dried oregano, paprika, salt, and black pepper. Mix well to combine all the ingredients.\n2. Divide the mixture into 4 equal portions and shape them into patties.\n3. Preheat a grill or skillet over medium heat. Cook the chicken patties for about 5-6 minutes per side or until they are cooked through and reach an internal temperature of 165°F (74°C).\n4. Toast the burger buns on the grill or in a toaster.\n5. Assemble the chicken burgers by placing a lettuce leaf on the bottom half of each bun. Top with a cooked chicken patty, tomato slices, onion slices, and cheese slices.\n6. Spread ketchup and mayonnaise on the top half of the buns.\n7. Place the top bun over the assembled ingredients to complete the burger.\n8. Serve the chicken burgers hot and enjoy!"
            },
              {
                "Name": "Chicken Wings",
                "Description": "Chicken wings are a popular appetizer or main dish made from chicken wings that are seasoned, baked or fried until crispy, and coated in a flavorful sauce. They can be enjoyed as a finger food or paired with dips and sides for a delicious meal.",
                "Cuisine": "Various",
                "MealType": "Appetizer/Main",
                "Ingredients": [
                  "1 kg chicken wings",
                  "2 tablespoons olive oil",
                  "1 teaspoon garlic powder",
                  "1 teaspoon paprika",
                  "1/2 teaspoon salt",
                  "1/4 teaspoon black pepper",
                  "1/2 cup hot sauce",
                  "2 tablespoons butter",
                  "1 tablespoon honey (optional, for sweetness)"
                ],
                "Method": "1. Preheat the oven to 200°C (400°F) and line a baking sheet with parchment paper.\n2. In a bowl, combine the olive oil, garlic powder, paprika, salt, and black pepper. Mix well.\n3. Add the chicken wings to the bowl and toss to coat them evenly with the spice mixture.\n4. Arrange the chicken wings in a single layer on the prepared baking sheet.\n5. Bake the chicken wings for 40-45 minutes, flipping them halfway through, until they are crispy and golden brown.\n6. In a small saucepan, combine the hot sauce, butter, and honey (if using). Heat the sauce over low heat, stirring occasionally, until the butter is melted and the ingredients are well combined.\n7. Remove the baked chicken wings from the oven and transfer them to a large bowl.\n8. Pour the hot sauce mixture over the chicken wings and toss to coat them thoroughly.\n9. Serve the chicken wings hot with your favorite dipping sauces and enjoy!"
              },
              {
                "Name": "Chicken Nuggets",
                "Description": "Chicken nuggets are bite-sized pieces of chicken that are breaded, fried, and served as a popular snack or meal option. They are crispy on the outside and tender on the inside, making them a favorite among both kids and adults.",
                "Cuisine": "Various",
                "MealType": "Snack/Main",
                "Ingredients": [
                  "500g boneless, skinless chicken breasts, cut into bite-sized pieces",
                  "1 cup all-purpose flour",
                  "1 teaspoon garlic powder",
                  "1 teaspoon onion powder",
                  "1/2 teaspoon paprika",
                  "1/2 teaspoon salt",
                  "1/4 teaspoon black pepper",
                  "2 eggs, beaten",
                  "1 cup breadcrumbs",
                  "Vegetable oil, for frying"
                ],
                "Method": "1. In a shallow bowl, combine the all-purpose flour, garlic powder, onion powder, paprika, salt, and black pepper.\n2. Dip each piece of chicken into the flour mixture, coating it well. Shake off any excess flour.\n3. Dip the flour-coated chicken into the beaten eggs, ensuring it is fully coated.\n4. Roll the chicken in the breadcrumbs, pressing gently to adhere the breadcrumbs to the chicken.\n5. Heat vegetable oil in a deep skillet or frying pan over medium heat.\n6. Fry the chicken nuggets in batches for about 4-5 minutes, or until they are golden brown and cooked through.\n7. Remove the chicken nuggets from the oil using a slotted spoon and place them on a paper towel-lined plate to drain excess oil.\n8. Serve the chicken nuggets hot with ketchup, barbecue sauce, or your favorite dipping sauces."
              },
              {
                "Name": "Chicken Popcorn",
                "Description": "Chicken popcorn is a bite-sized snack made from boneless chicken pieces that are coated in a seasoned batter and deep-fried until crispy. It is a popular finger food often enjoyed at parties, movie nights, or as an appetizer.",
                "Cuisine": "Various",
                "MealType": "Snack/Appetizer",
                "Ingredients": [
                  "500g boneless, skinless chicken breasts, cut into small pieces",
                  "1 cup all-purpose flour",
                  "1 teaspoon garlic powder",
                  "1 teaspoon paprika",
                  "1/2 teaspoon salt",
                  "1/4 teaspoon black pepper",
                  "1/2 teaspoon dried oregano",
                  "1/2 teaspoon dried thyme",
                  "1/4 teaspoon cayenne pepper (optional, for heat)",
                  "2 eggs, beaten",
                  "Vegetable oil, for frying"
                ],
                "Method": "1. In a bowl, combine the all-purpose flour, garlic powder, paprika, salt, black pepper, dried oregano, dried thyme, and cayenne pepper (if using). Mix well.\n2. Dip each piece of chicken into the beaten eggs, ensuring it is fully coated.\n3. Roll the egg-coated chicken in the seasoned flour mixture, pressing gently to adhere the flour mixture to the chicken.\n4. Heat vegetable oil in a deep skillet or frying pan over medium heat.\n5. Fry the chicken popcorn in batches for about 4-5 minutes, or until they are golden brown and cooked through.\n6. Remove the chicken popcorn from the oil using a slotted spoon and place them on a paper towel-lined plate to drain excess oil.\n7. Serve the chicken popcorn hot with ketchup, barbecue sauce, or your favorite dipping sauces."
              }
            
          
          
      
    
]
